[
    {
        "id": "histoire-fissure",
        "title": "AWS SAA : Une porte d'entrée vers le Cloud",
        "date": "Jan 15, 2026",
        "category": "Cloud, DevOps",
        "icon": "aws",
        "readTime": "3 min read",
        "excerpt": "Pourquoi j'ai pris la décision d'apprendre le Cloud et ses enjeux, mon avis et retour d'expérience sur la certification.",
        "content": "<h3 class='text-2xl font-bold text-violet-600 dark:text-violet-400 mb-4'>La découverte du Cloud</h3><p>Tout d'abord, je me suis pris de passion (classique je sais, mais réel) pour le Cloud et le DevOps lorsque j'ai voulu en apprendre plus sur les façons de déployer mon application Fissure.</p><p>Je me suis rendu compte du réel impact que pouvait avoir une infrastructure bien pensée et des enjeux impliqués, que cela soit sur les coûts, la disponibilité (High Availability), la scalabilité et la sécurité.</p><div class='my-8 h-px bg-slate-200 dark:bg-slate-700 w-full'></div><h3 class='text-2xl font-bold text-violet-600 dark:text-violet-400 mb-4'>Une première approche insuffisante</h3><p>Je me suis donc lancé dans l'apprentissage du Cloud en commençant par AWS, le leader du marché. Après avoir appris les bases du réseau, du scripting ainsi que de Linux, j'ai voulu passer la certification <strong>Cloud Practitioner</strong>.</p><p>Cependant, lors de mon apprentissage, je me suis rendu compte qu'elle était trop superficielle. Je voulais apprendre comment architecturer en détail, comprendre les possibilités et les meilleurs choix pour un besoin spécifique.</p><div class='my-8 h-px bg-slate-200 dark:bg-slate-700 w-full'></div><h3 class='text-2xl font-bold text-violet-600 dark:text-violet-400 mb-4'>Le choix de la Solutions Architect Associate</h3><p>Je me suis donc lancé dans l'apprentissage de la certification <strong>AWS Solutions Architect Associate (SAA-C03)</strong>. C'est une certification de niveau intermédiaire qui permet de valider les compétences d'un architecte cloud. Je me suis aussi dit que cela aurait un impact positif sur mon profil et mon CV.</p><p>J'ai donc commencé mon apprentissage et le verdict était clair : bien que théorique, si l'on ne rentre pas dans un bachotage de dumps d'examen, on apprend réellement le Cloud et les services proposés pour déployer l'infrastructure la plus adaptée à un besoin spécifique.</p><p>Bien que dense et nécessitant de se rappeler de beaucoup de détails, l'étude de cette certification m'a permis de comprendre les enjeux et les possibilités du Cloud et de commencer à penser une infra solide pour mon application.</p><div class='my-8 h-px bg-slate-200 dark:bg-slate-700 w-full'></div><h3 class='text-2xl font-bold text-violet-600 dark:text-violet-400 mb-4'>L'examen et le résultat</h3><p>J'ai bien évidemment passé la certification le 2 janvier 2026 et je l'ai obtenue du premier coup ! Le test est assez stressant de par la pression anti-triche de l'examen (j'ai dû reschedule une fois car je portais un casque pour le son...), mais sinon cela s'est très bien passé.</p><p>Je ne peux pas encore dire le réel impact de la certification aux yeux des recruteurs et sur le marché (même si elle est un peu considérée comme le <em>gold standard</em> aux U.S d'un point de vue Cloud). Mais dans tous les cas, l'apprentissage a pour moi été plus intéressant que le badge en lui-même. Je ressors donc satisfait de cette expérience.</p><p class='mt-8 font-medium'>Merci de votre temps et de votre lecture :)</p>"
    },
    {
        "id": "terraform-cert",
        "title": "Terraform Associate : inutile ? ",
        "date": "Janvier 2026",
        "category": "IaC",
        "readTime": "2 min read",
        "excerpt": "La certification Terraform Associate apprend elle réellement à architecturer en code, ou est-ce juste du bachotage ?",
        "content": "<h3 class='text-2xl font-bold text-violet-600 dark:text-violet-400 mb-4'>L'objectif de la certification</h3><p>Pour déployer mon application sur AWS, j'ai adopté une approche IaC (Infrastructure as Code) afin de versionner et coder mon infrastructure. En poursuivant ma route vers le DevOps et le SRE, je me suis dit que passer la certification Terraform Associate serait une excellente étape et un jalon significatif à atteindre.</p><div class='my-8 h-px bg-slate-200 dark:bg-slate-700 w-full'></div><h3 class='text-2xl font-bold text-violet-600 dark:text-violet-400 mb-4'>Théorie vs Pratique : le constat</h3><p>Cependant, lors de mon apprentissage, un constat s'est vite imposé. Après avoir lu toute la documentation et passé un premier examen blanc (avec un score honorable de 65%), je me suis rendu compte devant mon IDE que je ne savais pas écrire une seule ligne de Terraform [ sans IA ;) ].</p><p>Je comprenais parfaitement les concepts théoriques comme le <em>remote state</em> ou le <em>locking</em>, mais j'étais incapable de concevoir l'architecture du code, d'organiser les modules ou de définir les outputs.</p><div class='my-8 h-px bg-slate-200 dark:bg-slate-700 w-full'></div><h3 class='text-2xl font-bold text-violet-600 dark:text-violet-400 mb-4'>La leçon à retenir</h3><p>J'ai réalisé que la théorie apprise pour la certification est utile, voire indispensable : elle enseigne des concepts qui restent souvent cachés derrière des couches d'abstraction si l'on se contente d'écrire du code sans comprendre ce qui se passe en coulisses.</p><p>Mais la réflexion inverse est tout aussi vraie : si l'on ne se concentre que sur la théorie, on risque le syndrome de la page blanche au moment de passer à la pratique.</p><p>En conclusion, cette certification m'a rappelé une leçon essentielle : il est crucial de maîtriser son sujet théorique (documentation, concepts), mais tout aussi important de pratiquer intensément (hands-on, labs). C'est cette combinaison qui permet d'être réellement efficace, et je pense que ce principe s'applique à énormément de technologies et de compétences.</p><p class='mt-8 font-medium'>Merci pour votre lecture ! ;)</p>"
    }
]