[
  {
    "projectName": "Fissure – AWS Infrastructure",
    "projectDescription": "Infrastructure AWS complète déployée via Terraform (IaC). Architecture haute disponibilité avec ECS Fargate en subnets privés, RDS PostgreSQL, ALB pour le load balancing, et VPC sécurisé avec stratégie de séparation subnets publics/privés. Décisions d'architecture: ECS Fargate pour les conteneurs serverless (pas de gestion d'instances), RDS managé pour la fiabilité, NAT Gateway pour l'accès internet sécurisé depuis les subnets privés. Backend Clean Architecture (TypeScript/Express) containerisé avec Docker.",
    "projectDescriptionEN": "Complete AWS infrastructure deployed via Terraform (IaC). High-availability architecture with ECS Fargate in private subnets, RDS PostgreSQL, ALB for load balancing, and secure VPC with public/private subnet separation strategy. Architecture decisions: ECS Fargate for serverless containers (no instance management), managed RDS for reliability, NAT Gateway for secure internet access from private subnets. Clean Architecture backend (TypeScript/Express) containerized with Docker.",
    "technosImg": [
      "FaAws",
      "SiTerraform",
      "FaDocker",
      "SiPostgresql"
    ],
    "technos": [
      "AWS",
      "Terraform",
      "Docker",
      "PostgreSQL"
    ],
    "gitLink": "",
    "liveLink": "https://landing-page-fissure-4adi.vercel.app/",
    "projectImg": "/static/fissure.png"
  },
  {
    "projectName": "Portfolio",
    "projectDescription": "Ce portfolio est développé avec NextJs, TailwindCSS et ThreeJs pour offrir une expérience utilisateur fluide et immersive. Il présente mes compétences, mes projets et mon parcours de manière dynamique et interactive. J'ai utilisé ThreeJs pour intégrer des animations 3D et améliorer l'esthétique globale du site. Ce projet reflète mon savoir-faire en développement front-end avancé et mon souci du détail en termes d'UI/UX design.",
    "projectDescriptionEN": "This portfolio is built using NextJs, TailwindCSS, and ThreeJs to provide a smooth and immersive user experience. It showcases my skills, projects, and journey in a dynamic and interactive way. I utilized ThreeJs to integrate 3D animations and enhance the overall aesthetics of the site. This project highlights my expertise in advanced front-end development and my attention to detail in UI/UX design.",
    "technosImg": [
      "SiNextdotjs",
      "SiTailwindcss",
      "SiThreedotjs"
    ],
    "technos": [
      "NextJS",
      "TailwindCSS",
      "ThreeJS"
    ],
    "gitLink": "https://github.com/Pir4a/portfolio",
    "liveLink": "https://stephane-dedu-devportfolio.vercel.app/",
    "projectImg": "/static/portfolio.png"
  },
  {
    "projectName": "Car Rental",
    "projectDescription": "Ce projet est une application front-end de location de voitures. Développée avec React, TypeScript et TailwindCSS, elle offre une interface moderne et réactive permettant aux utilisateurs de rechercher, comparer et réserver des véhicules facilement. L'objectif était de créer une plateforme ergonomique avec une navigation fluide et un design épuré, optimisé pour une expérience utilisateur intuitive.",
    "projectDescriptionEN": "This project is a front-end car rental application. Developed with React, TypeScript, and TailwindCSS, it provides a modern and responsive interface, allowing users to search, compare, and book vehicles with ease. The goal was to create an ergonomic platform with smooth navigation and a clean design, optimized for an intuitive user experience.",
    "technosImg": [
      "FaReact",
      "SiTypescript",
      "SiTailwindcss"
    ],
    "technos": [
      "React",
      "TypeScript",
      "TailwindCSS"
    ],
    "gitLink": "https://github.com/Pir4a/car-rent-website",
    "liveLink": "https://car-rent-website-six.vercel.app",
    "projectImg": "/static/carrental.png"
  },
  {
    "projectName": "Mon Vieux Grimoire (OC)",
    "projectDescription": "Un projet back-end réalisé dans le cadre de ma formation OpenClassrooms. Mon Vieux Grimoire est une plateforme de notation de livres développée en NodeJs avec une base de données MongoDB. Il comprend un système d'authentification sécurisé, la gestion des utilisateurs et des avis, ainsi que des fonctionnalités CRUD avancées pour la gestion des livres.",
    "projectDescriptionEN": "A back-end project developed as part of my OpenClassrooms training. Mon Vieux Grimoire is a book rating platform built with NodeJs and a MongoDB database. It includes a secure authentication system, user and review management, as well as advanced CRUD functionalities for handling books.",
    "technosImg": [
      "FaNodeJs",
      "FaDatabase"
    ],
    "technos": [
      "NodeJS",
      "MongoDB"
    ],
    "gitLink": "https://github.com/Pir4a/OpenClassrooms-p5",
    "liveLink": "",
    "projectImg": "/static/grimoire.png"
  },
  {
    "projectName": "Zyzz Gym",
    "projectDescription": "Zyzz Gym est une application front-end dédiée aux salles de sport. Ce projet personnel a été conçu avec React, TypeScript et TailwindCSS pour proposer un site moderne et ergonomique aux amateurs de fitness. Il met en avant les différentes prestations proposées par la salle ainsi qu'un système de réservation simplifié.",
    "projectDescriptionEN": "Zyzz Gym is a front-end application dedicated to gyms. This personal project was built with React, TypeScript, and TailwindCSS to offer a modern and ergonomic site for fitness enthusiasts. It highlights the different services offered by the gym and features a streamlined booking system.",
    "technosImg": [
      "FaReact",
      "SiTypescript",
      "SiTailwindcss"
    ],
    "technos": [
      "React",
      "TypeScript",
      "TailwindCSS"
    ],
    "gitLink": "https://github.com/Pir4a/gym-website.git",
    "liveLink": "https://gym-website-ashy.vercel.app/",
    "projectImg": "/static/Zyzz.png"
  },
  {
    "projectName": "Premier Portfolio",
    "projectDescription": "Mon premier portfolio, développé avec React et TailwindCSS. Il présente mes compétences et mes projets a travers des projets réalisés en formation ou en autonomie.",
    "projectDescriptionEN": "My first portfolio, built with React and TailwindCSS. It showcases my skills and projects through projects developed during training or independently.",
    "technosImg": [
      "FaReact",
      "SiTailwindcss"
    ],
    "technos": [
      "React",
      "TailwindCSS"
    ],
    "gitLink": "https://github.com/Pir4a/OpenClassrooms-portfolio",
    "liveLink": "https://stephane-dedu-portfolio.vercel.app/",
    "projectImg": "/static/portfolioun.png"
  }
]